bin/cash/cash.7
.Dd January 14, 2019
.Dt CASH 7
.Os "Causal Agency"
.
.Sh NAME
.Nm cash
.Nd the Causal Agency shell
.
.Sh DESCRIPTION
.Nm
is a shell derived from
.Fx
.Xr sh 1 ,
which is in turn derived from Almquist shell.
It includes
.Xr editline 3
from
.Nx .
.
.Ss Differences from Xr sh 1
.Bl -bullet
.It
.Va ENV
defaults to
.Ql ${XDG_CONFIG_HOME:-${HOME}/.config}/cash/env.sh .
.
.It
.Va PS0
is printed before each prompt,
allowing multi-line prompts.
.
.It
Right-aligned prompts can be set with
.Va RPS1
and
.Va RPS2 .
.
.It
.Va PSlit
can be used to embed terminal escape sequences in prompts,
as in
.Nx
.Xr sh 1 .
.
.It
.Va HOME
is shortened to
.Sq ~
in prompt expansion.
.
.It
.Ic fc Fl s Ar = Ns Ar new
allows prefixing commands with
.Ar new .
.El
.
.Sh HISTORY
.Xr sh 1
sources were imported from
.Fx 12.0 .
.Xr editline 3
sources were imported from
.Nx 8.0 .
